samples/expression_bdd_mermaid/single_variable_unusual_name.md
```mermaid
%%{ init: {"theme": "default"} }%%
graph TB
  node000("variable_with_unusual$characters@123")
  node001["0"]
  style node001 fill:lightgray
  node002["1"]
  style node002 fill:lightgray
  node000 --> node001
  node000 --> node002
```
